IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu2_periph_ac_regs.xml
	<register id="FSICRX_AC" width="32" page="1" offset="0x162" internal="0" description="FSIB Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIDRX_AC" width="32" page="1" offset="0x166" internal="0" description="FSID Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="USBA_AC" width="32" page="1" offset="0x18a" internal="0" description="USBA Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM0_AC" width="32" page="1" offset="0x1b2" internal="0" description="HRPWM Controller Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM1_AC" width="32" page="1" offset="0x1b4" internal="0" description="HRPWM Controller Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM2_AC" width="32" page="1" offset="0x1b6" internal="0" description="HRPWM Controller Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CLA1_ACC" description="CLA1 Access Conditions to Peripheral" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="ETHERCAT_AC" width="32" page="1" offset="0x1b8" internal="0" description="ETHERCAT Controller Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="AESA_AC" width="32" page="1" offset="0x1bc" internal="0" description="AES Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="UARTA_AC" width="32" page="1" offset="0x1be" internal="0" description="UART Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="UARTB_AC" width="32" page="1" offset="0x1c0" internal="0" description="UART Controller Access Control Register">
		<bitfield id="CPUx_ACC" description="CPUx Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="PERIPH_AC_LOCK" width="32" page="1" offset="0x1fe" internal="0" description="Lock Register to stop Write access to peripheral Access register. ">
		<bitfield id="LOCK_AC_WR" description=" Lock control for Access control registers write." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
